{
  "backend/main.mo": "Main actor implementing inventory logic, user profiles, shops, products, stock movements, and authorization with migration support.",
  "backend/migration.mo": "Migration module converting old actor state to new types, mainly adding isSuperAdmin to user profiles while preserving other data.",
  "feature_evidence.json": "Feature evidence report linking frontend files and components to the super-admin UI update feature.",
  "frontend-file-summaries.txt": "List of summaries describing the purpose of each frontend file, including routing, hooks, pages, and components.",
  "frontend/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes.",
  "frontend/index.html": "Base HTML template loading the React app entry point.",
  "frontend/src/App.tsx": "Root React component configuring React Query, router, theming, and global toasts.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter name and email, preserving backend shop and admin fields on save.",
  "frontend/src/components/branding/Logo.tsx": "Simple component rendering the RK Solutions logo.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper with header, footer, and main content area for shop and admin portals.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying attribution and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with role‑based navigation, logout handling, and optional shop alerts and offline UI.",
  "frontend/src/components/layout/NotificationsBell.tsx": "Notification bell showing combined low‑stock and out‑of‑stock counts linked to the alerts page.",
  "frontend/src/components/layout/OfflineIndicator.tsx": "Shows an indicator when offline or syncing, linking to the sync page and displaying queued operations.",
  "frontend/src/components/shop/SaleDialog.tsx": "Dialog for recording a product sale by reducing stock via mutation and validating quantity.",
  "frontend/src/components/shop/StockInDialog.tsx": "Dialog for adding stock to a product using a mutation and simple quantity input.",
  "frontend/src/hooks/offline/useNetworkStatus.ts": "Tracks online/offline status using browser events.",
  "frontend/src/hooks/offline/useOfflineQueue.ts": "Maintains a list of queued offline operations and exposes pending count and retry placeholder.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity login, state management, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching and mutating user profiles, products, and shop data through the actor.",
  "frontend/src/index.css": "Tailwind base styles and custom design tokens for light and dark theme colors.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider around the app.",
  "frontend/src/pages/admin/AccessLogsPage.tsx": "Placeholder admin page showing future access log functionality with static UI.",
  "frontend/src/pages/admin/AdminHomePage.tsx": "Admin dashboard with links to shop management, logs, and a super-admin recovery dialog.",
  "frontend/src/pages/admin/ShopsAdminPage.tsx": "Admin page that lists shops, handles suspend/reactivate actions, and shows super-admin error recovery UI.",
  "frontend/src/pages/auth/AdminLoginPage.tsx": "Admin login screen using Internet Identity that redirects authenticated users to the admin panel.",
  "frontend/src/pages/auth/ShopLoginPage.tsx": "Shop login page supporting Internet Identity sign‑in, shop signup navigation, and admin login access.",
  "frontend/src/pages/auth/ShopSignUpPage.tsx": "Two‑step shop signup flow using Internet Identity authentication followed by shop creation with error handling.",
  "frontend/src/pages/shop/AlertsPage.tsx": "Displays low‑stock and out‑of‑stock product alerts for the shop with links to restock items.",
  "frontend/src/pages/shop/DashboardPage.tsx": "Shop dashboard showing product counts, stock alerts, and navigation to product management.",
  "frontend/src/pages/shop/ProductCreatePage.tsx": "Form page that lets a shop owner create a new product with name, description, initial quantity, and low‑stock threshold, then submits via createProduct and navigates back.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Displays detailed product info, stock status, recent movements, and provides actions like editing, sales, and stock‑in via dialogs.",
  "frontend/src/pages/shop/ProductEditPage.tsx": "Loads an existing product, pre-fills fields, allows editing name, description, and threshold, then updates the product and redirects.",
  "frontend/src/pages/shop/ProductsPage.tsx": "Shows a searchable and filterable product list with stock badges and actions to view, edit, delete, or create products.",
  "frontend/src/pages/shop/SyncStatusPage.tsx": "Displays online/offline status, queued offline operations, and allows retrying sync with details on pending operations and conflict rules.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack router tree for auth, shop, and admin sections, including protected layouts that redirect unauthenticated users and conditionally show profile setup.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, fonts, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing the MVP scope, architecture, known issues, and existing feature implementations for the SaaS inventory system."
}