{
  "backend/main.mo": "Main Motoko canister implementing shop, product, stock movement, and user profile storage with admin authorization and user profile management.",
  "feature_evidence.json": "Feature evidence report describing the login UI update linking to the Super Admin portal.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including routing, layouts, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS base file defining light/dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Root React component configuring React Query, the router, theming, and toast notifications.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter name and email and saving the profile while preserving shopId.",
  "frontend/src/components/branding/Logo.tsx": "Simple component rendering the RK Solutions logo image.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper rendering header, footer, and main content for shop or admin roles.",
  "frontend/src/components/layout/Footer.tsx": "Footer with copyright notice and caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, role-based navigation, offline and alert indicators, and logout handling.",
  "frontend/src/components/layout/NotificationsBell.tsx": "Bell icon showing total low-stock and out-of-stock alerts linked to the alerts page.",
  "frontend/src/components/layout/OfflineIndicator.tsx": "Indicator showing online/offline status and queued offline operations with link to sync page.",
  "frontend/src/components/shop/SaleDialog.tsx": "Dialog for recording a product sale by decreasing stock via updateStock mutation.",
  "frontend/src/components/shop/StockInDialog.tsx": "Dialog for adding stock to a product using updateStock mutation.",
  "frontend/src/hooks/offline/useNetworkStatus.ts": "Hook that tracks online/offline network status using browser events.",
  "frontend/src/hooks/offline/useOfflineQueue.ts": "Hook maintaining a list of queued offline operations with a retry placeholder.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login/clear functions.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, products, shops, and analytics via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/admin/AccessLogsPage.tsx": "Admin page placeholder showing upcoming access log functionality.",
  "frontend/src/pages/admin/AdminHomePage.tsx": "Admin dashboard linking to shop management and access logs with an access notice.",
  "frontend/src/pages/admin/ShopsAdminPage.tsx": "Displays all shops for admins, allowing suspension and reactivation with confirmation dialogs.",
  "frontend/src/pages/auth/AdminLoginPage.tsx": "Provides an Internet Identity–based login page that redirects authenticated users to the admin portal.",
  "frontend/src/pages/auth/ShopLoginPage.tsx": "Shop user login page supporting Internet Identity authentication and navigation to signup or admin login.",
  "frontend/src/pages/auth/ShopSignUpPage.tsx": "Handles two-step shop account creation: user authentication and shop registration with error handling.",
  "frontend/src/pages/shop/AlertsPage.tsx": "Shows low-stock and out-of-stock product alerts with links to restock individual items.",
  "frontend/src/pages/shop/DashboardPage.tsx": "Displays shop overview metrics and quick access to product management and stock alerts.",
  "frontend/src/pages/shop/ProductCreatePage.tsx": "Form page that lets a shop owner create a new product with name, description, initial quantity, and low‑stock threshold, then submits via createProduct and navigates back to the product list.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Displays detailed information for a product, including stock status and recent movements, with actions for editing, recording sales, and stock‑in events.",
  "frontend/src/pages/shop/ProductEditPage.tsx": "Provides a form for editing an existing product’s name, description, and low‑stock threshold, loading initial values and saving updates via updateProduct.",
  "frontend/src/pages/shop/ProductsPage.tsx": "Lists all shop products with search and stock‑status filtering, and supports viewing, editing, and deleting products.",
  "frontend/src/pages/shop/SyncStatusPage.tsx": "Shows online/offline status and queued offline operations, with options to retry sync and view operation details and errors.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route tree for auth, shop, and admin sections, including layouts with identity checks and profile-setup gating.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash segments, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, container queries, animations, and plugin setup.",
  "project_state.json": "Describes the project’s current MVP scope, architecture, known issues, and implemented features for an inventory SaaS system."
}